Applying **qcon-demo-org**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # github_branch_protection.branch_protection_spring-petclinic-2 will be created
+   resource "github_branch_protection" "branch_protection_spring-petclinic-2" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       blocks_creations                = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = "spring-petclinic-2"
+       require_conversation_resolution = true
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = true
+           required_approving_review_count = 1
        }
    }

  # github_repository.spring-petclinic-2 will be created
+   resource "github_repository" "spring-petclinic-2" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       archived                    = false
+       auto_init                   = true
+       branches                    = (known after apply)
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = false
+       description                 = "A sample Spring-based application"
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "spring-petclinic-2"
+       node_id                     = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       visibility                  = "public"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

```
github_repository.spring-petclinic-2: Creating...
github_branch_protection.branch_protection_spring-petclinic-2: Creating...
github_branch_protection.branch_protection_spring-petclinic-2: Creation complete after 9s [id=BPR_kwDOJIuEUM4CGkHs]
github_repository.spring-petclinic-2: Creation complete after 10s [id=spring-petclinic-2]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```